var markerinfo = [
  {
    aptname: '매탄힐스테이트아파트',
    componet: [
      {
        detail_address: '107동 1102호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-1184',
        endYn:'N'
      },
      {
        detail_address: '111동 801호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-0174',
        endYn:'N'
      },
      {
        detail_address: '124동 104호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-1874',
        endYn:'N'
      },
      {
        detail_address: '128동 2104호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-8524',
        endYn:'N'
      },
      {
        detail_address: '130동 1701호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-9341',
        endYn:'N'
      }
    ]
  },
  {
    aptname: '인계삼성아파트',
    componet: [
      {
        detail_address: '101호 704호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-5316',
        endYn:'N'
      },
      {
        detail_address: '101호 1202호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-6216',
        endYn:'N'
      },
      {
        detail_address: '102호 201호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-7736',
        endYn:'N'
      },
      {
        detail_address: '102호 1702호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-0615',
        endYn:'N'
      },
      {
        detail_address: '103호 903호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-6071',
        endYn:'N'
      }
    ]
  },
  {
    aptname: '래미안노블클래스 1단지',
    componet: [
      {
        detail_address: '101호 1301호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-6309',
        endYn:'N'
      },
      {
        detail_address: '102호 1801호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-7415',
        endYn:'N'
      },
      {
        detail_address: '103호 703호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-1035',
        endYn:'N'
      },
      {
        detail_address: '104호 402호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-6031',
        endYn:'N'
      },
      {
        detail_address: '105호 801호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-8152',
        endYn:'N'
      }
    ]
  }
]


var locations = [
  {
    aptname: '매탄현대힐스테이트아파트',
    latlng: [
      {
        lat: 37.261693,
        lng: 127.042067
      },
      {
        lat: 37.261693,
        lng: 127.042067
      }
    ]
  },
  {
    aptname: '래미안노블클래스 1단지',
    latlng: [
      {}
    ]
  }
]


var loads = [
  {
    lat: 37.270559,
    lng: 127.035999
  },
  {
    lat: 37.270107,
    lng: 127.035143
  },
  {
    lat: 37.269988,
    lng: 127.034322
  },
  {
    lat: 37.269988,
    lng: 127.034322
  },
  {
    lat: 37.269672,
    lng: 127.034976
  },
  {
    lat: 37.266803,
    lng: 127.033860
  },
  {
    lat: 37.266365,
    lng: 127.035857
  },
  {
    lat: 37.266805,
    lng: 127.036034
  },
  {
    lat: 37.266446,
    lng: 127.038528
  },
  {
    lat: 37.266288,
    lng: 127.039971
  },
  {
    lat: 37.266489,
    lng: 127.040491
  },
  {
    lat: 37.267582,
    lng: 127.040899
  },
  {
    lat: 37.268880,
    lng: 127.040105
  },
  {
    lat: 37.270007,
    lng: 127.041038
  },
  {
    lat: 37.269691,
    lng: 127.042422
  },
  {
    lat: 37.265294,
    lng: 127.040394
  },
  {
    lat: 37.264991,
    lng: 127.041601
  },
  {
    lat: 37.264991,
    lng: 127.041601
  },
  {
    lat: 37.264227,
    lng: 127.044900
  },
  {
    lat: 37.263143,
    lng: 127.043838
  },
  {
    lat: 37.261965,
    lng: 127.043591
  },
  {
    lat: 37.261700,
    lng: 127.044878
  }
]
var endLocations = [
  {
    lat: 37.271823,
    lng: 127.039879
  },
  {
    lat: 37.271089,
    lng: 127.037122
  },
  {
    lat: 37.271089,
    lng: 127.037122
  },
  {
    lat: 37.270585,
    lng: 127.036017
  },
  {
    lat: 37.269857,
    lng: 127.036468
  },
  {
    lat: 37.270559,
    lng: 127.035999
  }
]

var locationss = [
  {
    lat: 37.271720,
    lng: 127.040652
  },
  {
    lat: 37.271139,
    lng: 127.039261
  },
  {
    lat: 37.270569,
    lng: 127.038007
  },
  {
    lat: 37.271723,
    lng: 127.038713
  },
  {
    lat: 37.270995,
    lng: 127.036347
  },
  {
    lat: 37.271333,
    lng: 127.036546
  },
  {
    lat: 37.271916,
    lng: 127.036755
  },
  {
    lat: 37.272072,
    lng: 127.036994
  },
  {
    lat: 37.272315,
    lng: 127.036450
  },
  {
    lat: 37.269457,
    lng: 127.035590
  },
  {
    lat: 37.269905,
    lng: 127.035739
  },
  {
    lat: 37.270247,
    lng: 127.035980
  },
  {
    lat: 37.269709,
    lng: 127.036237
  },
  {
    lat: 37.269530,
    lng: 127.036500
  },
  {
    lat: 37.269918,
    lng: 127.034038
  },
  {
    lat: 37.269832,
    lng: 127.034553
  },
  {
    lat: 37.268684,
    lng: 127.034108
  },
  {
    lat: 37.268402,
    lng: 127.033491
  },
  {
    lat: 37.268225,
    lng: 127.033931
  },
  {
    lat: 37.267035,
    lng: 127.038013
  },
  {
    lat: 37.267842,
    lng: 127.038478
  },
  {
    lat: 37.268662,
    lng: 127.037925
  },
  {
    lat: 37.267859,
    lng: 127.036085
  },
  {
    lat: 37.266937,
    lng: 127.034771
  },
  {
    lat: 37.266288,
    lng: 127.038708
  },
  {
    lat: 37.266562,
    lng: 127.040244
  },
  {
    lat: 37.268419,
    lng: 127.040804
  },
  {
    lat: 37.269537,
    lng: 127.041292
  },
  {
    lat: 37.270498,
    lng: 127.041592
  },
  {
    lat: 37.265998,
    lng: 127.041706
  },
  {
    lat: 37.266450,
    lng: 127.041882
  },
  {
    lat: 37.266249,
    lng: 127.042644
  },
  {
    lat: 37.265754,
    lng: 127.042472
  },
  {
    lat: 37.265344,
    lng: 127.042182
  },
  {
    lat: 37.261115,
    lng: 127.044108
  },
  {
    lat: 37.260500,
    lng: 127.044128
  },
  {
    lat: 37.260329,
    lng: 127.044949
  },
  {
    lat: 37.260799,
    lng: 127.045485
  },
  {
    lat: 37.261345,
    lng: 127.045576
  }
]



var labelText =
  ["5분전",
  "10분전",
  "15분전",
  "20분전",
  "25분전",
  "30분전",
  "35분전",
  "40분전",
  "45분전",
  "50분전",
  "55분전",
  "60분전",
  "65분전",
  "70분전",
  "75분전",
  "80분전",
  "85분전",
  "90분전",
  "95분전",
  "100분전",
  "105분전",
  "110분전",
  "115분전",
  "120분전",
  "125분전",
  "130분전",
  "135분전",
  "140분전",
  "145분전",
  "150분전",
  "155분전",
  "160분전",
  "165분전",
  "170분전"]



var labelText2 =
  ["14시 5분도착",
    "14시 10분도착",
    "14시 15분도착",
    "14시 20분도착",
    "14시 25분도착",
    "14시 30분도착",
    "14시 35분도착",
    "14시 40분도착",
    "14시 45분도착",
    "14시 50분도착",
    "14시 55분도착",
    "15시 0분도착",
    "15시 5분도착",
    "15시 10분도착",
    "15시 15분도착",
    "15시 20분도착",
    "15시 25분도착",
    "15시 30분도착",
    "15시 35분도착",
    "15시 40분도착",
    "15시 45분도착",
    "15시 50분도착",
    "15시 55분도착",
    "16시 0분도착",
    "16시 5분도착",
    "16시 10분도착",
    "16시 15분도착",
    "16시 20분도착",
    "16시 25분도착",
    "16시 30분도착",
    "16시 35분도착",
    "16시 40분도착",
    "16시 45분도착",
    "16시 50분도착",
    "16시 55분도착"]
