var markerinfo = [
  {
    aptname : '매탄힐스테이트아파트',
    componet : [
      {
        detail_address: '107동 1102호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-1184'
      },
      {
        detail_address: '111동 801호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-0174'
      },
      {
        detail_address: '124동 104호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-1874'
      },
      {
        detail_address: '128동 2104호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-8524'
      },
      {
        detail_address: '130동 1701호',
        prefix_address: '경기도 수원시 영통구 권광로260번길 36',
        postnum: '64905-0403-9341'
      },
    ]
  },
  {
    aptname : '인계삼성아파트',
    componet : [
      {
        detail_address: '101호 704호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-5316'
      },
      {
        detail_address: '101호 1202호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-6216'
      },
      {
        detail_address: '102호 201호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-7736'
      },
      {
        detail_address: '102호 1702호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-0615'
      },
      {
        detail_address: '103호 903호',
        prefix_address: '경기도 수원시 팔달구 권광로276번길 8',
        postnum: '64905-0404-6071'
      }
    ]
  },
  {
    aptname : '래미안노블클래스 1단지',
    componet : [
      {
        detail_address: '101호 1301호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-6309'
      },
      {
        detail_address: '102호 1801호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-7415'
      },
      {
        detail_address: '103호 703호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-1035'
      },
      {
        detail_address: '104호 402호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-6031'
      },
      {
        detail_address: '105호 801호',
        prefix_address: '경기도 수원시 팔달구 권광로 246',
        postnum: '64905-0405-8152'
      }
    ]
  }
]


var locations = [
  {
    aptname : '매탄현대힐스테이트아파트',
    latlng : [
      {
        lat: 37.261693,
        lng: 127.042067
      },
      {
        lat: 37.261693,
        lng: 127.042067
      }
    ]
  },
  {
    aptname : '래미안노블클래스 1단지',
    latlng : [
      {
      }
    ]
  }
]



var loads  = [
  {
    lat: 37.261693,
    lng: 127.042067
  },
  {
    lat: 37.261693,
    lng: 127.042067
  }
]


var locationss = [
  {
    lat: 37.271450,
    lng: 127.041177
  },
  {
    lat: 37.271720,
    lng: 127.040652
  },
  {
    lat: 37.271139,
    lng: 127.039261
  },
  {
    lat: 37.270569,
    lng: 127.038007
  },
  {
    lat: 37.271723,
    lng: 127.038713
  },
  {
    lat: 37.270995,
    lng: 127.036347
  },
  {
    lat: 37.271333,
    lng: 127.036546
  },
  {
    lat: 37.271916,
    lng: 127.036755
  },
  {
    lat: 37.272072,
    lng: 127.036994
  },
  {
    lat: 37.272315,
    lng: 127.036450
  },
  {
    lat: 37.269457,
    lng: 127.035590
  },
  {
    lat: 37.269905,
    lng: 127.035739
  },
  {
    lat: 37.270247,
    lng: 127.035980
  },
  {
    lat: 37.269709,
    lng: 127.036237
  },
  {
    lat: 37.269530,
    lng: 127.036500
  },
  {
    lat: 37.269918,
    lng: 127.034038
  },
  {
    lat: 37.268684,
    lng: 127.034108
  },
  {
    lat: 37.268402,
    lng: 127.033491
  },
  {
    lat: 37.269832,
    lng: 127.034553
  },
  {
    lat: 37.268225,
    lng: 127.033931
  },
  {
    lat:  37.267035,
    lng: 127.038013
  },
  {
    lat: 37.267842,
    lng: 127.038478
  },
  {
    lat: 37.268662,
    lng: 127.037925
  },
  {
    lat:  37.267859,
    lng: 127.036085
  },
  {
    lat: 37.266937,
    lng: 127.034771
  },
  {
    lat:  37.266288,
    lng: 127.038708
  },
  {
    lat: 37.266562,
    lng: 127.040244
  },
  {
    lat: 37.268419,
    lng: 127.040804
  },
  {
    lat:  37.269537,
    lng: 127.041292
  },
  {
    lat: 37.270498,
    lng: 127.041592
  },
  {
    lat:  37.265998,
    lng: 127.041706
  },
  {
    lat: 37.266450,
    lng: 127.041882
  },
  {
    lat: 37.266249,
    lng: 127.042644
  },
  {
    lat:  37.265754,
    lng: 127.042472
  },
  {
    lat: 37.265344,
    lng: 127.042182
  },
  {
    lat:  37.261115,
    lng: 127.044108
  },
  {
    lat: 37.260500,
    lng: 127.044128
  },
  {
    lat: 37.260329,
    lng: 127.044949
  },
  {
    lat:  37.260799,
    lng: 127.045485
  },
  {
    lat: 37.261345,
    lng: 127.045576
  }
]
